espressif/esp-agents-firmware/examples/matter_controller/sdkconfig.defaults
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 5.5.2 Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32s3"

#
# Bootloader config
#

#
# Application Rollback
#
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y
# end of Application Rollback

#
# Log
#

#
# Format
#
CONFIG_BOOTLOADER_LOG_COLORS=y
# end of Format
# end of Log
# end of Bootloader config

#
# Serial flasher config
#
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
# end of Serial flasher config

#
# Partition Table
#
CONFIG_PARTITION_TABLE_CUSTOM=y
# end of Partition Table

#
# ESP Agent Setup Configuration
#
CONFIG_AGENT_SETUP_RAINMAKER_DEVICE_NAME="Matter Controller"
CONFIG_AGENT_SETUP_DEFAULT_AGENT_ID="matter_controller"
# end of ESP Agent Setup Configuration

#
# ESP Speech Recognition
#

#
# Load Multiple Wake Words (WakeNet9)
#
CONFIG_SR_WN_WN9_HILEXIN=y
CONFIG_SR_WN_WN9_HIESP=y
# end of Load Multiple Wake Words (WakeNet9)
# end of ESP Speech Recognition

#
# ESP RainMaker App Wi-Fi Provisioning
#
CONFIG_APP_NETWORK_ASYNCHRONOUS_CONNECTION=y
CONFIG_APP_WIFI_PROV_COMPAT=n
# end of ESP RainMaker App Wi-Fi Provisioning

#
# Component config
#

#
# Bluetooth
#
CONFIG_BT_NIMBLE_ENABLED=y

#
# NimBLE Options
#

#
# General
#
CONFIG_BT_NIMBLE_MEM_ALLOC_MODE_EXTERNAL=y
# end of General

#
# Roles and Profiles
#
CONFIG_BT_NIMBLE_ROLE_CENTRAL=n
CONFIG_BT_NIMBLE_ROLE_OBSERVER=n
# end of Roles and Profiles
# end of NimBLE Options

#
# Controller Options
#
CONFIG_BT_CTRL_RUN_IN_FLASH_ONLY=y
# end of Controller Options
# end of Bluetooth

#
# ESP PSRAM
#
CONFIG_SPIRAM=y

#
# SPI RAM config
#
CONFIG_SPIRAM_XIP_FROM_PSRAM=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=0
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=262144
CONFIG_SPIRAM_ALLOW_BSS_SEG_EXTERNAL_MEMORY=y
CONFIG_SPIRAM_ALLOW_NOINIT_SEG_EXTERNAL_MEMORY=y
# end of SPI RAM config
# end of ESP PSRAM

#
# ESP System Settings
#
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP_SYSTEM_EVENT_QUEUE_SIZE=64
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
# end of ESP System Settings

#
# Wi-Fi
#
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=64
CONFIG_ESP_WIFI_CACHE_TX_BUFFER_NUM=64
CONFIG_ESP_WIFI_IRAM_OPT=n
CONFIG_ESP_WIFI_RX_IRAM_OPT=n
CONFIG_ESP_WIFI_SOFTAP_SUPPORT=n
# end of Wi-Fi

#
# FreeRTOS
#

#
# Kernel
#
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_TIMER_TASK_STACK_DEPTH=3120
CONFIG_FREERTOS_VTASKLIST_INCLUDE_COREID=y
CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y
# end of Kernel
# end of FreeRTOS

#
# Log
#
CONFIG_LOG_VERSION_2=y

#
# Format
#
CONFIG_LOG_COLORS=y
# end of Format
# end of Log

#
# LWIP
#
CONFIG_LWIP_TCPIP_RECVMBOX_SIZE=64
CONFIG_LWIP_IPV6_AUTOCONFIG=y
CONFIG_LWIP_IPV6_NUM_ADDRESSES=6

#
# TCP
#
CONFIG_LWIP_TCP_SND_BUF_DEFAULT=65535
CONFIG_LWIP_TCP_WND_DEFAULT=65535
CONFIG_LWIP_TCP_RECVMBOX_SIZE=64
# end of TCP

#
# Hooks
#
CONFIG_LWIP_HOOK_IP6_ROUTE_DEFAULT=y
CONFIG_LWIP_HOOK_ND6_GET_GW_DEFAULT=y
# end of Hooks
# end of LWIP

#
# mbedTLS
#
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y

#
# mbedTLS v3.x related
#
CONFIG_MBEDTLS_SSL_KEEP_PEER_CERTIFICATE=n
# end of mbedTLS v3.x related

#
# Certificate Bundle
#
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_CMN=y
# end of Certificate Bundle
CONFIG_MBEDTLS_HKDF_C=y
# end of mbedTLS

#
# ESP-MQTT Configurations
#
CONFIG_MQTT_USE_CUSTOM_CONFIG=y
CONFIG_MQTT_TASK_STACK_SIZE=8192
CONFIG_MQTT_OUTBOX_DATA_ON_EXTERNAL_MEMORY=y
# end of ESP-MQTT Configurations

#
# TCP Transport
#

#
# Websocket
#
CONFIG_WS_BUFFER_SIZE=2048
# end of Websocket
# end of TCP Transport

#
# ESP Client Only Matter Controller Config
#
CONFIG_ESP_CLIENT_ONLY_MATTER_CONTROLLER=y
# end of ESP Client Only Matter Controller Config

#
# Audio Codec Configuration
#

#
# Audio Decoder Configuration
#
CONFIG_AUDIO_DECODER_AAC_SUPPORT=n
CONFIG_AUDIO_DECODER_G711_SUPPORT=n
CONFIG_AUDIO_DECODER_AMRNB_SUPPORT=n
CONFIG_AUDIO_DECODER_AMRWB_SUPPORT=n
CONFIG_AUDIO_DECODER_FLAC_SUPPORT=n
CONFIG_AUDIO_DECODER_VORBIS_SUPPORT=n
CONFIG_AUDIO_DECODER_ADPCM_SUPPORT=n
CONFIG_AUDIO_DECODER_ALAC_SUPPORT=n
CONFIG_AUDIO_DECODER_PCM_SUPPORT=n
CONFIG_AUDIO_DECODER_SBC_SUPPORT=n
CONFIG_AUDIO_DECODER_LC3_SUPPORT=n
# end of Audio Decoder Configuration

#
# Audio Simple Decoder Configuration
#
CONFIG_AUDIO_SIMPLE_DEC_WAV_SUPPORT=n
CONFIG_AUDIO_SIMPLE_DEC_M4A_SUPPORT=n
CONFIG_AUDIO_SIMPLE_DEC_TS_SUPPORT=n
# end of Audio Simple Decoder Configuration

#
# Audio Encoder Configuration
#
CONFIG_AUDIO_ENCODER_AAC_SUPPORT=n
CONFIG_AUDIO_ENCODER_G711_SUPPORT=n
CONFIG_AUDIO_ENCODER_AMRNB_SUPPORT=n
CONFIG_AUDIO_ENCODER_AMRWB_SUPPORT=n
CONFIG_AUDIO_ENCODER_ADPCM_SUPPORT=n
CONFIG_AUDIO_ENCODER_ALAC_SUPPORT=n
CONFIG_AUDIO_ENCODER_PCM_SUPPORT=n
CONFIG_AUDIO_ENCODER_SBC_SUPPORT=n
CONFIG_AUDIO_ENCODER_LC3_SUPPORT=n
# end of Audio Encoder Configuration
# end of Audio Codec Configuration

#
# ESP Audio Simple Player
#

#
# Audio Simple Player IO Stream
#
CONFIG_ESP_AUDIO_SIMPLE_PLAYER_HTTP_EN=n
CONFIG_ESP_AUDIO_SIMPLE_PLAYER_FILE_EN=n
# end of Audio Simple Player IO Stream
# end of ESP Audio Simple Player

#
# CHIP Core
#

#
# General Options
#
CONFIG_USE_MINIMAL_MDNS=n
CONFIG_CHIP_MEM_ALLOC_MODE_EXTERNAL=y
# end of General Options

#
# Networking Options
#
CONFIG_NUM_UDP_ENDPOINTS=16
# end of Networking Options
# end of CHIP Core

#
# CHIP Device Layer
#

#
# General Options
#
CONFIG_MAX_EVENT_QUEUE_SIZE=20
# end of General Options

#
# BLE Options
#
CONFIG_ENABLE_CHIPOBLE=n
# end of BLE Options

#
# Event Logging Options
#
CONFIG_EVENT_LOGGING_CRIT_BUFFER_SIZE=256
CONFIG_EVENT_LOGGING_INFO_BUFFER_SIZE=256
CONFIG_EVENT_LOGGING_DEBUG_BUFFER_SIZE=256
# end of Event Logging Options

#
# Network Commissioning Driver Endpoint Id
#
CONFIG_WIFI_NETWORK_COMMISSIONING_DRIVER=n
# end of Network Commissioning Driver Endpoint Id
# end of CHIP Device Layer

#
# ESP Matter
#
CONFIG_ESP_MATTER_MAX_DYNAMIC_ENDPOINT_COUNT=1
CONFIG_ESP_MATTER_MEM_ALLOC_MODE_EXTERNAL=y
CONFIG_ESP_MATTER_ENABLE_MATTER_SERVER=n
# end of ESP Matter

#
# ESP Matter Controller
#
CONFIG_ESP_MATTER_CONTROLLER_ENABLE=y
CONFIG_ESP_MATTER_COMMISSIONER_ENABLE=n
CONFIG_CUSTOM_OPERATIONAL_CREDS_ISSUER=y
# end of ESP Matter Controller

#
# mmap file support format
#
CONFIG_MMAP_FILE_NAME_LENGTH=32
# end of mmap file support format

#
# ESP WebSocket client
#
CONFIG_ESP_WS_CLIENT_SEPARATE_TX_LOCK=y
# end of ESP WebSocket client

#
# mDNS
#

#
# MDNS Memory Configuration
#
CONFIG_MDNS_MEMORY_ALLOC_SPIRAM=y
# end of MDNS Memory Configuration
# end of mDNS

#
# LVGL configuration
#

#
# Memory Settings
#
CONFIG_LV_USE_CLIB_MALLOC=y
CONFIG_LV_USE_CLIB_STRING=y
CONFIG_LV_USE_CLIB_SPRINTF=y
# end of Memory Settings

#
# HAL Settings
#
CONFIG_LV_DEF_REFR_PERIOD=10
# end of HAL Settings

#
# Operating System (OS)
#
CONFIG_LV_OS_FREERTOS=y
# end of Operating System (OS)

#
# Font Usage
#

#
# Enable built-in fonts
#
CONFIG_LV_FONT_MONTSERRAT_20=y
# end of Enable built-in fonts
CONFIG_LV_FONT_FMT_TXT_LARGE=y
# end of Font Usage

#
# Others
#
CONFIG_LV_USE_IMGFONT=y
# end of Others

#
# Examples
#
CONFIG_LV_BUILD_EXAMPLES=n
# end of Examples
# end of LVGL configuration
# end of Component config
CONFIG_IDF_EXPERIMENTAL_FEATURES=y
